export default {
  start:{
    name: '洛阳',
    N: 34.62,//维度
    E: 112.45,//经度
  },
  endArr:[{
    name: '深圳',
    N: 22,//维度
    E: 114,//经度
  },
  
  {
    name: '黑龙江',
    N: 48.5156,
    E: 128.1445,
  },
  
  {
    name: '新疆',
    N: 41.748,
    E: 84.9023,
  },
  
  {
    name: '德黑兰',
    N: 35,
    E: 51,
  },

  {
    name: '开罗',
    N: 30, 
    E: 31,
  },
  {
    name: '惠灵顿',
    N: -41, 
    E: 174,
  },

  {
    name: '檀香山',
    N: 21, 
    E: -157,
  },
  {
    name: '怀特霍斯',
    N: 60, 
    E: -135,
  },
  {
    name: '缅甸',
    N: 16, 
    E: 96,
  },

    {
    name: '雅加达',
    N: 6, 
    E: 106,
  },
  {
    name: '珀斯',
    N: -31, 
    E: 115,
  },
  {
    name: '摩尔曼斯克',
    N: 68, 
    E: 33,
  },
  {
    name: '科伦坡',
    N: 6, 
    E: 79,
  },

  {
    name: '墨西哥城',
    N: 19, 
    E: -99,
  },
  {
    name: '亚的斯亚贝巴',
    N: 9, 
    E: 38,
  },
  {
    name: '内罗毕',
    N: -1, 
    E: 36,
  },
  {
    name: '巴西利亚',
    N: -15, 
    E: -47,
  },
  
  
  {
    name: '东京',
    N: 35,
    E: 139,
  },
  {
    name: '新加坡',
    N: 1,
    E: 103,
  },
  {
    name: '纽约',
    N: 40,
    E: -73,
  },
  // {
  //   name: '伦敦',
  //   N: 52,
  //   E: 0.1,
  // },
  {
    name: '莫斯科',
    N: 55.7,
    E: 55.6,
  },
  {
    name: '新德里',
    N: 28.6,
    E: 77.2,
  },
  {
    name: '渥太华',
    N: 45.4,
    E: -75.7,
  },
  {
    name: '巴黎',
    N: 48.9,
    E: 2,
  },
  {
    name: '柏林',
    N: 52.5,
    E: 13,
  },
  {
    name: '罗马',
    N: 41.9,
    E: 12.6,
  },
  {
    name: '旧金山',
    N: 37.8,
    E: -122.5,
  },
  
  
  {
    name: '墨尔本',
    N: -37.9,
    E: 145,
  },
  
  {
    name: '里约热内卢',
    N: -23,
    E: -43.2,
  },
  {
    name: '圣地亚哥',
    N: -33.5,
    E: -70,
  },
  {
    name: '开普敦',
    N: -34,
    E: 18.5,
  },
  {
    name: '的黎波里',
    N: 33,
    E: 13.2,
  },
  {
    name: '伊斯坦布尔',
    N: 41,
    E: 29,
  },
  {
    name: '阿拉木图',
    N: 43.3,
    E: 77,
  },
  {
    name: '	班吉',
    N: 4.4,
    E: 18.6,
  },
  ]
}